In [3]:
import numpy as np
import pandas as pd

In [6]:
from numpy.random import randn

In [7]:
a = {'A' : [1,2,np.nan], 'B' : [5, np.nan, np.nan], 'C' : [1,2,3]}

In [8]:
df = pd.DataFrame(a)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [12]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [13]:
df.fillna(value='Fill value')

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [14]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [15]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3